/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   formats.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: Xecca <ensimgen@gmail.com>                 +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/10/22 20:53:33 by Xecca             #+#    #+#             */
/*   Updated: 2019/10/22 21:00:26 by Xecca            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"

void	int_f(int d);		// %d - Десятичное число целого типа со знаком

void	char_f(char c);		// %с - Символ типа char

void	str_f(char *str);	// %s - Строка символов

void	double_f(double d);	// %f - (float) Десятичное число с плавающей точкой

void	perc_f();			// %% - Выводит символ %